
## Plan Result (prod_dns)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_dns_record.main_records[&#34;home&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_dns_record.main_records["home"] will be created
  + resource "cloudflare_dns_record" "main_records" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      + content             = (sensitive value)
      + created_on          = (known after apply)
      + data                = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "home"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = []
      + tags_modified_on    = (known after apply)
      + ttl                 = 60
      + type                = "A"
      + zone_id             = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":479,"Program":"tfcmt","SHA1":"","Target":"prod_dns","Vars":{}} -->